module.exports = [
  {
    'id': '110000',
    'name': '北京市',
    'cityList': [
      {
        'id': '110000',
        'name': '北京市'
      }
    ]
  },
  {
    'id': '120000',
    'name': '天津市',
    'cityList': [
      {
        'id': '120000',
        'name': '天津市'
      }
    ]
  },
  {
    'id': '130000',
    'name': '河北省',
    'cityList': [
      {
        'id': '130100',
        'name': '石家庄市'
      },
      {
        'id': '130200',
        'name': '唐山市'
      }
    ]
  },
  {
    'id': '140000',
    'name': '山西省',
    'cityList': [
      {
        'id': '140100',
        'name': '太原市'
      },
      {
        'id': '140500',
        'name': '晋城市'
      },
      {
        'id': '140600',
        'name': '朔州市'
      },
      {
        'id': '141100',
        'name': '吕梁市'
      }
    ]
  },
  {
    'id': '150000',
    'name': '内蒙古自治区',
    'cityList': [
      {
        'id': '150100',
        'name': '呼和浩特市'
      },
      {
        'id': '150200',
        'name': '包头市'
      },
      {
        'id': '150600',
        'name': '鄂尔多斯市'
      },
      {
        'id': '150700',
        'name': '呼伦贝尔市'
      }
    ]
  },
  {
    'id': '210000',
    'name': '辽宁省',
    'cityList': [
      {
        'id': '210100',
        'name': '沈阳市'
      },
      {
        'id': '210200',
        'name': '大连市'
      },
      {
        'id': '210300',
        'name': '鞍山市'
      },
      {
        'id': '210400',
        'name': '抚顺市'
      },
      {
        'id': '210600',
        'name': '丹东市'
      },
      {
        'id': '210700',
        'name': '锦州市'
      },
      {
        'id': '210800',
        'name': '营口市'
      },
      {
        'id': '211100',
        'name': '盘锦市'
      }
    ]
  },
  {
    'id': '220000',
    'name': '吉林省',
    'cityList': [
      {
        'id': '220100',
        'name': '长春市'
      },
      {
        'id': '220500',
        'name': '通化市'
      }
    ]
  },
  {
    'id': '230000',
    'name': '黑龙江省',
    'cityList': [
      {
        'id': '230100',
        'name': '哈尔滨市'
      },
      {
        'id': '230600',
        'name': '大庆市'
      }
    ]
  },
  {
    'id': '310000',
    'name': '上海市',
    'cityList': [
      {
        'id': '310000',
        'name': '上海市'
      }
    ]
  },
  {
    'id': '320000',
    'name': '江苏省',
    'cityList': [
      {
        'id': '320100',
        'name': '南京市'
      },
      {
        'id': '320200',
        'name': '无锡市'
      },
      {
        'id': '320281',
        'name': '江阴市'
      },
      {
        'id': '320282',
        'name': '宜兴市'
      },
      {
        'id': '320300',
        'name': '徐州市'
      },
      {
        'id': '320400',
        'name': '常州市'
      },
      {
        'id': '320500',
        'name': '苏州市'
      },
      {
        'id': '320600',
        'name': '南通市'
      },
      {
        'id': '320700',
        'name': '连云港市'
      },
      {
        'id': '320900',
        'name': '盐城市'
      },
      {
        'id': '321000',
        'name': '扬州市'
      },
      {
        'id': '321012',
        'name': '扬州市'
      },
      {
        'id': '321100',
        'name': '镇江市'
      },
      {
        'id': '321200',
        'name': '泰州市'
      }
    ]
  },
  {
    'id': '330000',
    'name': '浙江省',
    'cityList': [
      {
        'id': '330100',
        'name': '杭州市'
      },
      {
        'id': '330200',
        'name': '宁波市'
      },
      {
        'id': '330300',
        'name': '温州市'
      },
      {
        'id': '330381',
        'name': '瑞安市'
      },
      {
        'id': '330400',
        'name': '嘉兴市'
      },
      {
        'id': '330500',
        'name': '湖州市'
      },
      {
        'id': '330600',
        'name': '绍兴市'
      },
      {
        'id': '330700',
        'name': '金华市'
      },
      {
        'id': '330800',
        'name': '衢州市'
      },
      {
        'id': '331000',
        'name': '台州市'
      }
    ]
  },
  {
    'id': '340000',
    'name': '安徽省',
    'cityList': [
      {
        'id': '340100',
        'name': '合肥市'
      },
      {
        'id': '340200',
        'name': '芜湖市'
      },
      {
        'id': '340400',
        'name': '淮南市'
      },
      {
        'id': '340500',
        'name': '马鞍山市'
      },
      {
        'id': '340600',
        'name': '淮北市'
      },
      {
        'id': '340800',
        'name': '安庆市'
      },
      {
        'id': '341500',
        'name': '六安市'
      }
    ]
  },
  {
    'id': '350000',
    'name': '福建省',
    'cityList': [
      {
        'id': '350100',
        'name': '福州市'
      },
      {
        'id': '350200',
        'name': '厦门市'
      },
      {
        'id': '350300',
        'name': '莆田市'
      },
      {
        'id': '350400',
        'name': '三明市'
      },
      {
        'id': '350500',
        'name': '泉州市'
      },
      {
        'id': '350600',
        'name': '漳州市'
      },
      {
        'id': '350800',
        'name': '龙岩市'
      }
    ]
  },
  {
    'id': '360000',
    'name': '江西省',
    'cityList': [
      {
        'id': '360100',
        'name': '南昌市'
      },
      {
        'id': '360200',
        'name': '景德镇市'
      },
      {
        'id': '360400',
        'name': '九江市'
      },
      {
        'id': '360700',
        'name': '赣州市'
      },
      {
        'id': '361100',
        'name': '上饶市'
      }
    ]
  },
  {
    'id': '370000',
    'name': '山东省',
    'cityList': [
      {
        'id': '370100',
        'name': '济南市'
      },
      {
        'id': '370200',
        'name': '青岛市'
      },
      {
        'id': '370300',
        'name': '淄博市'
      },
      {
        'id': '370500',
        'name': '东营市'
      },
      {
        'id': '370600',
        'name': '烟台市'
      },
      {
        'id': '370700',
        'name': '潍坊市'
      },
      {
        'id': '370800',
        'name': '济宁市'
      },
      {
        'id': '371000',
        'name': '威海市'
      },
      {
        'id': '371100',
        'name': '日照市'
      },
      {
        'id': '371300',
        'name': '临沂市'
      },
      {
        'id': '371500',
        'name': '聊城市'
      },
      {
        'id': '371600',
        'name': '滨州市'
      }
    ]
  },
  {
    'id': '410000',
    'name': '河南省',
    'cityList': [
      {
        'id': '410100',
        'name': '郑州市'
      },
      {
        'id': '410300',
        'name': '洛阳市'
      },
      {
        'id': '410500',
        'name': '安阳市'
      },
      {
        'id': '411000',
        'name': '许昌市'
      }
    ]
  },
  {
    'id': '420000',
    'name': '湖北省',
    'cityList': [
      {
        'id': '420100',
        'name': '武汉市'
      },
      {
        'id': '420200',
        'name': '黄石市'
      },
      {
        'id': '420300',
        'name': '十堰市'
      },
      {
        'id': '420500',
        'name': '宜昌市'
      },
      {
        'id': '420600',
        'name': '襄阳市'
      },
      {
        'id': '420900',
        'name': '孝感市'
      },
      {
        'id': '421000',
        'name': '荆州市'
      },
      {
        'id': '421100',
        'name': '黄冈市'
      }
    ]
  },
  {
    'id': '430000',
    'name': '湖南省',
    'cityList': [
      {
        'id': '430100',
        'name': '长沙市'
      },
      {
        'id': '430200',
        'name': '株洲市'
      },
      {
        'id': '430300',
        'name': '湘潭市'
      },
      {
        'id': '430400',
        'name': '衡阳市'
      },
      {
        'id': '431300',
        'name': '娄底市'
      }
    ]
  },
  {
    'id': '440000',
    'name': '广东省',
    'cityList': [
      {
        'id': '440100',
        'name': '广州市'
      },
      {
        'id': '440300',
        'name': '深圳市'
      },
      {
        'id': '440400',
        'name': '珠海市'
      },
      {
        'id': '440600',
        'name': '佛山市'
      },
      {
        'id': '440700',
        'name': '江门市'
      },
      {
        'id': '440800',
        'name': '湛江市'
      },
      {
        'id': '441300',
        'name': '惠州市'
      },
      {
        'id': '441800',
        'name': '清远市'
      },
      {
        'id': '441900',
        'name': '东莞市'
      },
      {
        'id': '442000',
        'name': '中山市'
      }
    ]
  },
  {
    'id': '450000',
    'name': '广西壮族自治区',
    'cityList': [
      {
        'id': '450100',
        'name': '南宁市'
      },
      {
        'id': '450200',
        'name': '柳州市'
      }
    ]
  },
  {
    'id': '460000',
    'name': '海南省',
    'cityList': [
      {
        'id': '460100',
        'name': '海口市'
      }
    ]
  },
  {
    'id': '500000',
    'name': '重庆市',
    'cityList': [
      {
        'id': '500000',
        'name': '重庆市'
      }
    ]
  },
  {
    'id': '510000',
    'name': '四川省',
    'cityList': [
      {
        'id': '510100',
        'name': '成都市'
      },
      {
        'id': '510500',
        'name': '泸州市'
      },
      {
        'id': '510700',
        'name': '绵阳市'
      },
      {
        'id': '511100',
        'name': '乐山市'
      }
    ]
  },
  {
    'id': '520000',
    'name': '贵州省',
    'cityList': [
      {
        'id': '520100',
        'name': '贵阳市'
      },
      {
        'id': '520200',
        'name': '六盘水市'
      },
      {
        'id': '520300',
        'name': '遵义市'
      }
    ]
  },
  {
    'id': '530000',
    'name': '云南省',
    'cityList': [
      {
        'id': '530100',
        'name': '昆明市'
      },
      {
        'id': '530300',
        'name': '曲靖市'
      },
      {
        'id': '530700',
        'name': '丽江市'
      },
      {
        'id': '532500',
        'name': '红河'
      },
      {
        'id': '532501',
        'name': '个旧市'
      }
    ]
  },
  {
    'id': '610000',
    'name': '陕西省',
    'cityList': [
      {
        'id': '610100',
        'name': '西安市'
      },
      {
        'id': '610300',
        'name': '宝鸡市'
      },
      {
        'id': '610400',
        'name': '咸阳市'
      },
      {
        'id': '610800',
        'name': '榆林市'
      }
    ]
  },
  {
    'id': '620000',
    'name': '甘肃省',
    'cityList': [
      {
        'id': '620100',
        'name': '兰州市'
      }
    ]
  },
  {
    'id': '630000',
    'name': '青海省',
    'cityList': [
      {
        'id': '630100',
        'name': '西宁市'
      }
    ]
  },
  {
    'id': '640000',
    'name': '宁夏回族自治区',
    'cityList': [
      {
        'id': '640100',
        'name': '银川市'
      }
    ]
  },
  {
    'id': '650000',
    'name': '新疆维吾尔自治区',
    'cityList': [
      {
        'id': '650100',
        'name': '乌鲁木齐市'
      },
      {
        'id': '659001',
        'name': '石河子市'
      }
    ]
  },
  {
    'id': '999999',
    'name': '测试用省份',
    'cityList': [
      {
        'id': '999999',
        'name': '测试用城市'
      }
    ]
  }
]
